'use client';

import { useRouter } from 'next/navigation';
import css from './offer.module.css'; // импортируем стили

const OfertaPage = () => {
  const router = useRouter();

  return (
    <div className={css.container}>
      <button className={css.backBtn} onClick={() => router.back()}>{'<'}</button>
      <h1 className={css.title}>ПУБЛИЧНАЯ ОФЕРТА</h1>

      <section className={css.section}>
        <h2 className={css.subtitle}>Общие положения</h2>
        <p className={css.paragraph}>
          В настоящей Публичной оферте содержатся условия заключения Договора об оказании услуг (далее по тексту - «Договор об оказании услуг» и/или «Договор»). Настоящей офертой признается предложение, адресованное одному или нескольким конкретным лицам, которое достаточно определенно и выражает намерение лица, сделавшего предложение, считать себя заключившим Договор с адресатом, которым будет принято предложение.
        </p>
        <p className={css.paragraph}>
          Совершение указанных в настоящей Оферте действий является подтверждением согласия обеих Сторон заключить Договор об оказании услуг на условиях, в порядке и объеме, изложенных в настоящей Оферте.
        </p>
        <p className={css.paragraph}>
          Нижеизложенный текст Публичной оферты является официальным публичным предложением Исполнителя, адресованный заинтересованному кругу лиц заключить Договор об оказании услуг в соответствии с положениями пункта 2 статьи 437 Гражданского кодекса РФ.
        </p>
        <p className={css.paragraph}>
          Договор об оказании услуг считается заключенным и приобретает силу с момента совершения Сторонами действий, предусмотренных в настоящей Оферте, и, означающих безоговорочное, а также полное принятие всех условий настоящей Оферты без каких-либо изъятий или ограничений на условиях присоединения.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Термины и определения</h2>
        <p className={css.paragraph}>
          <strong>Договор</strong> – текст настоящей Оферты с Приложениями, являющимися неотъемлемой частью настоящей Оферты, акцептованный Заказчиком путем совершения конклюдентных действий, предусмотренных настоящей Офертой.
        </p>
        <p className={css.paragraph}>
          <strong>Конклюдентные действия</strong> — это поведение, которое выражает согласие с предложением контрагента заключить, изменить или расторгнуть договор. Действия состоят в полном или частичном выполнении условий, которые предложил контрагент.
        </p>
        <p className={css.paragraph}>
          <strong>Сайт Исполнителя в сети «Интернет»</strong> – совокупность программ для электронных вычислительных машин и иной информации, содержащейся в информационной системе, доступ к которой обеспечивается посредством сети «Интернет» по доменному имени и сетевому адресу: <a className={css.link} href="https://coffee-hec1.vercel.app/pages/menu">https://coffee-hec1.vercel.app/pages/menu</a>
        </p>
        <p className={css.paragraph}>
          <strong>Стороны Договора (Стороны)</strong> – Исполнитель и Заказчик.
        </p>
        <p className={css.paragraph}>
          <strong>Услуга</strong> – услуга, оказываемая Исполнителем Заказчику в порядке и на условиях, установленных настоящей Офертой.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Предмет Договора</h2>
        <p className={css.paragraph}>
          Исполнитель обязуется оказать Заказчику Услуги, а Заказчик обязуется оплатить их в размере, порядке и сроки, установленные настоящим Договором.
        </p>
        <p className={css.paragraph}>
          Наименование, количество, порядок и иные условия оказания Услуг определяются на основании сведений Исполнителя при оформлении заявки Заказчиком, либо устанавливаются на сайте Исполнителя в сети «Интернет» <a className={css.link} href="https://coffee-hec1.vercel.app/pages/menu">https://coffee-hec1.vercel.app/pages/menu</a>
        </p>
        <p className={css.paragraph}>
          Исполнитель оказывает Услуги по настоящему Договору лично, либо с привлечением третьих лиц, при этом за действия третьих лиц Исполнитель отвечает перед Заказчиком как за свои собственные.
        </p>
        <p className={css.paragraph}>
          Договор заключается путем акцепта настоящей Оферты через совершение конклюдентных действий, выраженных в:
          <ul>
            <li>действиях, связанных с регистрацией учетной записи на Сайте Исполнителя в сети «Интернет» при наличии необходимости регистрации учетной записи;</li>
            <li>оформлении и направлении Заказчиком заявки в адрес Исполнителя для оказания Услуг;</li>
            <li>действиях, связанных с оплатой Услуг Заказчиком;</li>
            <li>действиях, связанных с оказанием Услуг Исполнителем.</li>
          </ul>
          Данный перечень неисчерпывающий, могут быть и другие действия, которые ясно выражают намерение лица принять предложение контрагента.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Права и обязанности Сторон</h2>
        <h3>Права и обязанности Исполнителя:</h3>
        <p className={css.paragraph}>
          Исполнитель обязуется оказать Услуги в соответствии с положениями настоящего Договора, в сроки и объеме, указанные в настоящем Договоре и (или) в порядке, указанном на Сайте Исполнителя.
        </p>
        <p className={css.paragraph}>
          Исполнитель обязуется предоставлять Заказчику доступ к разделам Сайта, необходимым для получения информации, согласно пункту 2.1. Договора.
        </p>
        <p className={css.paragraph}>
          Исполнитель несет ответственность за хранение и обработку персональных данных Заказчика, обеспечивает сохранение конфиденциальности этих данных и использует их исключительно для качественного оказания Услуг Заказчику.
        </p>
        <p className={css.paragraph}>
          Исполнитель оставляет за собой право изменять сроки (период) оказания Услуг и условия настоящей Оферты в одностороннем порядке без предварительного уведомления Заказчика, публикуя указанные изменения на Сайте Исполнителя в сети «Интернет». При этом новые / измененные условия, указываемые на Сайте, действуют только в отношении вновь заключаемых Договоров.
        </p>
        <h3>Права и обязанности Заказчика:</h3>
        <p className={css.paragraph}>
          Заказчик обязан предоставлять достоверную информацию о себе при получении соответствующих Услуг.
        </p>
        <p className={css.paragraph}>
          Заказчик обязуется не воспроизводить, не повторять, не копировать, не продавать, а также не использовать в каких бы то ни было целях информацию и материалы, ставшие ему доступными в связи с оказанием Услуг, за исключением личного использования непосредственно самим Заказчиком без предоставления в какой-либо форме доступа каким-либо третьим лицам.
        </p>
        <p className={css.paragraph}>
          Заказчик обязуется принять Услуги, оказанные Исполнителем.
        </p>
        <p className={css.paragraph}>
          Заказчик вправе потребовать от Исполнителя вернуть денежные средства за неоказанные услуги, некачественно оказанные услуги, услуги, оказанные с нарушением сроков оказания, а также, если Заказчик решил отказаться от услуг по причинам, не связанным с нарушением обязательств со стороны Исполнителя, исключительно по основаниям, предусмотренным действующим законодательством Российской Федерации.
        </p>
        <p className={css.paragraph}>
          Заказчик гарантирует, что все условия Договора ему понятны; Заказчик принимает условия без оговорок, а также в полном объеме.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Цена и порядок расчетов</h2>
        <p className={css.paragraph}>
          Стоимость услуг Исполнителя, оказываемых Заказчиком и порядок их оплаты, определяются на основании сведений Исполнителя при оформлении заявки Заказчиком либо устанавливаются на Сайте Исполнителя в сети «Интернет»: <a className={css.link} href="https://coffee-hec1.vercel.app/pages/menu">https://coffee-hec1.vercel.app/pages/menu</a>
        </p>
        <p className={css.paragraph}>
          Все расчеты по Договору производятся в безналичном порядке.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Конфиденциальность и безопасность</h2>
        <p className={css.paragraph}>
          При реализации настоящего Договора Стороны обеспечивают конфиденциальность и безопасность персональных данных в соответствии с актуальной редакцией ФЗ от 27.07.2006 г. № 152-ФЗ «О персональных данных» и ФЗ от 27.07.2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации».
        </p>
        <p className={css.paragraph}>
          Стороны обязуются сохранять конфиденциальность информации, полученной в ходе исполнения настоящего Договора, и принять все возможные меры, чтобы предохранить полученную информацию от разглашения.
        </p>
        <p className={css.paragraph}>
          Под конфиденциальной информацией понимается любая информация, передаваемая Исполнителем и Заказчиком в процессе реализации Договора и подлежащая защите, исключения указаны ниже.
        </p>
        <p className={css.paragraph}>
          Такая информация может содержаться в предоставляемых Исполнителю локальных нормативных актах, договорах, письмах, отчетах, аналитических материалах, результатах исследований, схемах, графиках, спецификациях и других документах, оформленных как на бумажных, так и на электронных носителях.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Форс-мажор</h2>
        <p className={css.paragraph}>
          Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по Договору, если надлежащее исполнение оказалось невозможным вследствие непреодолимой силы, то есть чрезвычайных и непредотвратимых при данных условиях обстоятельств, под которыми понимаются: запретные действия властей, эпидемии, блокада, эмбарго, землетрясения, наводнения, пожары или другие стихийные бедствия.
        </p>
        <p className={css.paragraph}>
          В случае наступления этих обстоятельств Сторона обязана в течение 30 (Тридцати) рабочих дней уведомить об этом другую Сторону.
        </p>
        <p className={css.paragraph}>
          Документ, выданный уполномоченным государственным органом, является достаточным подтверждением наличия и продолжительности действия непреодолимой силы.
        </p>
        <p className={css.paragraph}>
          Если обстоятельства непреодолимой силы продолжают действовать более 60 (Шестидесяти) рабочих дней, то каждая Сторона вправе отказаться от настоящего Договора в одностороннем порядке.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Ответственность Сторон</h2>
        <p className={css.paragraph}>
          В случае неисполнения и/или ненадлежащего исполнения своих обязательств по Договору, Стороны несут ответственность в соответствии с условиями настоящей Оферты.
        </p>
        <p className={css.paragraph}>
          Исполнитель не несет ответственности за неисполнение и/или ненадлежащее исполнение обязательств по Договору, если такое неисполнение и/или ненадлежащее исполнение произошло по вине Заказчика.
        </p>
        <p className={css.paragraph}>
          Сторона, не исполнившая или ненадлежащим образом исполнившая обязательства по Договору, обязана возместить другой Стороне причиненные такими нарушениями убытки.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Срок действия настоящей Оферты</h2>
        <p className={css.paragraph}>
          Оферта вступает в силу с момента размещения на Сайте Исполнителя и действует до момента её отзыва Исполнителем.
        </p>
        <p className={css.paragraph}>
          Исполнитель оставляет за собой право внести изменения в условия Оферты и/или отозвать Оферту в любой момент по своему усмотрению. Сведения об изменении или отзыве Оферты доводятся до Заказчика по выбору Исполнителя посредством размещения на сайте Исполнителя в сети «Интернет», в Личном кабинете Заказчика, либо путем направления соответствующего уведомления на электронный или почтовый адрес, указанный Заказчиком при заключении Договора или в ходе его исполнения.
        </p>
        <p className={css.paragraph}>
          Договор вступает в силу с момента Акцепта условий Оферты Заказчиком и действует до полного исполнения Сторонами обязательств по Договору.
        </p>
        <p className={css.paragraph}>
          Изменения, внесенные Исполнителем в Договор и опубликованные на сайте в форме актуализированной Оферты, считаются принятыми Заказчиком в полном объеме.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Дополнительные условия</h2>
        <p className={css.paragraph}>
          Договор, его заключение и исполнение регулируется действующим законодательством Российской Федерации. Все вопросы, не урегулированные настоящей Офертой или урегулированные не полностью, регулируются в соответствии с материальным правом Российской Федерации.
        </p>
        <p className={css.paragraph}>
          В случае возникновения спора, который может возникнуть между Сторонами в ходе исполнения ими своих обязательств по Договору, заключенному на условиях настоящей Оферты, Стороны обязаны урегулировать спор мирным путем до начала судебного разбирательства.
        </p>
        <p className={css.paragraph}>
          Судебное разбирательство осуществляется в соответствии с законодательством Российской Федерации. Споры или разногласия, по которым Стороны не достигли договоренности, подлежат разрешению в соответствии с законодательством РФ. Досудебный порядок урегулирования спора является обязательным.
        </p>
        <p className={css.paragraph}>
          В качестве языка Договора, заключаемого на условиях настоящей Оферты, а также языка, используемого при любом взаимодействии Сторон (включая ведение переписки, предоставление требований / уведомлений / разъяснений, предоставление документов и т. д.), Стороны определили русский язык.
        </p>
        <p className={css.paragraph}>
          Все документы, подлежащие предоставлению в соответствии с условиями настоящей Оферты, должны быть составлены на русском языке либо иметь перевод на русский язык, удостоверенный в установленном порядке.
        </p>
        <p className={css.paragraph}>
          Бездействие одной из Сторон в случае нарушения условий настоящей Оферты не лишает права заинтересованной Стороны осуществлять защиту своих интересов позднее, а также не означает отказа от своих прав в случае совершения одной из Сторон подобных либо сходных нарушений в будущем.
        </p>
        <p className={css.paragraph}>
          Если на Сайте Исполнителя в сети «Интернет» есть ссылки на другие веб-сайты и материалы третьих лиц, такие ссылки размещены исключительно в целях информирования, и Исполнитель не имеет контроля в отношении содержания таких сайтов или материалов. Исполнитель не несет ответственность за любые убытки или ущерб, которые могут возникнуть в результате использования таких ссылок.
        </p>
      </section>

      <section className={css.section}>
        <h2 className={css.subtitle}>Реквизиты Исполнителя</h2>
        <p className={css.paragraph}>
          <strong>Полное наименование:</strong> Пономарев Александр Игоревич
        </p>
        <p className={css.paragraph}>
          <strong>ИНН:</strong> 616712086883
        </p>
        <p className={css.paragraph}>
          <strong>ОГРН/ОГРНИП:</strong> 323619600018672
        </p>
        <p className={css.paragraph}>
          <strong>Контактный телефон:</strong> +7 961 414-11-30
        </p>
        <p className={css.paragraph}>
          <strong>Контактный e-mail:</strong> aprnd95@gmail.com
        </p>
      </section>
    </div>
  );
};

export default OfertaPage;